var taskContentArray = [
  {
    id: 1,
    src: 'img/page01_8-march.jpg',
    alt: '8 марта',
    newSrc: 'img/page01_clara-zetkin.jpg',
    newAlt: 'Клара Цеткин',
    question: ['История возникновения женского праздника 8 марта отсылает нас к началу XX века. Кому из ниже перечисленных женщин принадлежит идея празднования Международного женского дня?'],
    variants: ['Роза Люксембург', 'Клара Цеткин', 'Луиза Отто-Петерс', 'Лаура Лафарг'],
    rightAns: 1,
    content: ['Считается, что идея проведения Международного женского дня принадлежит немецкой коммунистке Кларе Цеткин. В 1910 году на Второй Международной социалистической женской конференции, проходившей в Копенгагене, она предложила учредить Международный женский день.']
  },{
    id: 2,
    src: 'img/page02_romeo-julietta.jpg',
    alt: 'Ромео и Джульетта',
    newSrc: 'img/page02_julietta-house.jpg',
    newAlt: 'Дом Джульетты',
    question: ['В каком городе жила Джульетта – главная героиня романа Уильяма Шекспира «Ромео и Джульетта»?'],
    variants: ['Рим', 'Флоренция', 'Верона', 'Венеция'],
    rightAns: 2,
    content: ['В прологе к роману можно найти следующие строки:','«Две равно уважаемых семьи','В Вероне, где встречают нас событья,','Ведут междоусобные бои','И не хотят унять кровопролитья».','Джульетта Капулетти в романе Шекспира была представительницей знатной веронской семьи. Сейчас в итальянском городе Верона одно из самых посещаемых мест - дворик рядом с «Дом Джульетты». Здесь туристы могут проникнуться атмосферой старого города, прикоснуться к бронзовой статуе Джульетты (что считается хорошей приметой), загадать заветное желание или оставить послание для волонтёров Клуба Джульетты, которые помогают советом и добрым словом в решении житейских вопросов.']
  },{
    id: 3,
    src: 'img/page03_keln.jpg',
    alt: 'Кёльн',
    newSrc: 'img/page03_odecolone.jpg',
    newAlt: 'Одеколон',
    question: ['Какому из этих слов «дал жизнь» немецкий город Кёльн?'],
    variants: ['Одеколон', 'Шампунь', 'Лосьон', 'Пудра'],
    rightAns: 0,
    content: ['Одеколон (фр. eau de Cologne — «кёльнская вода») — духи, созданные итальянским парфюмером Йоганном Марией Фарина, который основал свою парфюмерную фабрику в Кёльне.',
            'Со временем название «Eau de Cologne» стало общим обозначением духов с лёгким запахом. В этом случае подразумевается ароматизированная вода, в состав которой входит 70 % алкоголя и от 2 до 5 % ароматических веществ.'
            ]
  },{
    id: 4,
    src: 'img/page04_gerbers.jpg',
    alt: 'Герберы',
    newSrc: 'img/page04_gerbers.jpg',
    newAlt: 'Герберы',
    question: ['Как называются цветы, изображённые на фотографии?'],
    variants: ['Герберы', 'Гортензии', 'Пионы', 'Гладиолусы'],
    rightAns: 0,
    content: ['Это герберы. По форме они похожи на цветки представителей родов Нивяник, Остеоспермум и другие «ромашки»: окраска цветков герберы может быть любой, кроме синей. Герберы выращивают во всём мире (в том числе в оранжереях) как красивоцветущие декоративные растения — в первую очередь на срезку, а также как садовые растения, иногда как комнатные растения.']
  },{
    id: 5,
    src: 'img/page05_meditation.jpg',
    alt: 'Медитация',
    newSrc: 'img/page05_lotos.jpg',
    newAlt: 'Лотос',
    question: ['Какой из цветков является символом чистоты в восточной философии?'],
    variants: ['Ландыш', 'Лилия', 'Лотос', 'Роза'],
    rightAns: 2,
    content: ['Лотос является символом чистоты в буддизме и символизирует изначальные воды, духовное раскрытие, мудрость и нирвану: вырастая из грязи, он остается чистым - так же, как просветлённый Будда.']
  },{
    id: 6,
    src: 'img/page06_money-tree.jpg',
    alt: 'Денежное дерево',
    newSrc: 'img/page06_money-tree.jpg',
    newAlt: 'Денежное дерево',
    question: ['Этот цветок не прихотлив в уходе, пользуется большой популярностью среди цветоводов. Он встречается во многих домах. В офисах, можно сказать, необходимый атрибут, как дырокол или чайник. Как называется цветок, изображённый на фотографии?'],
    variants: ['Кактус', 'Офисный дикобраз', 'Денежное дерево', 'Фикус'],
    rightAns: 2,
    content: ['Это «денежное дерево» или толстянка древовидная. Люди считают, что это растение хорошо чувствует финансовое положение хозяев и может привлекать благосостояние. Из-за его внешнего вида (мелких мясистых листиков, похожих на монеты) «денежное дерево» привлекает внимание ещё и поклонников фен-шуя.']
  },{
    id: 7,
    src: 'img/page07_eggs-1.jpg',
    alt: 'Яйцо пашот',
    newSrc: 'img/page07_eggs-2.jpg',
    newAlt: 'Время варки куриных яиц',
    question: ['Всем кулинарам: любителям и профессионалам часто приходится работать с одними и теми же ингредиентами при создании разных блюд. Даже куриное яйцо можно приготовить по-разному: сварить «в мешочек», вкрутую, сделать яйцо пашот или яйцо Бенедикт.', 
              'Сколько времени после закипания воды нужно, чтобы сварить яйцо всмятку?'
              ],
    variants: ['2 минуты', '4 минут', '10 минут', '15 минут'],
    rightAns: 0,
    content: ['Яйца всмятку варятся в течение 2 минут после закипания воды (и желток, и белок останутся жидкими) или 3 минуты (желток будет жидким, а белок – почти твердым).']
  },{
    id: 8,
    src: 'img/page08_soup.jpg',
    alt: 'Рассольник',
    newSrc: 'img/page08_soup.jpg',
    newAlt: 'Рассольник',
    question: ['Как называется суп из соленых огурцов?'],
    variants: ['Щи', 'Рассольник', 'Суп-пюре', 'Уха'],
    rightAns: 1,
    content: ['Рассольник — блюдо русской кухни, суп, основой которого являются солёные огурцы, также может добавляться огуречный рассол. Рассольники готовят на бульонах: костном, мясо-костном, рыбном, на грибном отваре. Отпускают рассольники  с почками, потрохами и другими мясопродуктами.']
  },{
    id: 9,
    src: 'img/page09_panna-cotta.jpg',
    alt: 'Панакота',
    newSrc: 'img/page09_panna-cotta.jpg',
    newAlt: 'Панакота',
    question: ['Какое из итальянских блюд изображено на фотографии?'],
    variants: ['Тирамису', 'Панакота', 'Рикотта', 'Ризотто'],
    rightAns: 1,
    content: ['Панакота или Панна-котта (итал. Panna cotta — «Варёные сливки») — северо-итальянский десерт из сливок, сахара и ванили.',
              'Родиной десерта является итальянский Пьемонт. Дословный перевод этого лакомства с итальянского языка звучит как «вареный крем», однако на самом деле это скорее кремовый пудинг с добавлением разных ингредиентов. Для приготовления блюда сливки с сахаром и ванилью нагреваются и варятся на слабом огне 15 минут. К массе добавляется желатин, смесь затем разливают в формы, после остывания выкладывают из формы на тарелки.'
              ]
  },{
    id: 10,
    src: 'img/page10_audrey-hepbern-1.jpg',
    alt: 'Одри Хепберн',
    newSrc: 'img/page10_audrey-hepbern-2.jpg',
    newAlt: 'Одри Хепберн',
    question: ['Эта актриса в середине XX века успешно вошла в киноиндустрию, изменив представление о женской красоте и стиле. Короткая стрижка, которую носила её героиня в фильме «Римские каникулы», оказала сильное влияние на развитие моды того времени. Имя актрисы …'],
    variants: ['Грейс Келли', 'Мерлин Монро', 'Одри Хепберн', 'Элизабет Тейлор'],
    rightAns: 2,
    content: ['Одри Хепберн. Фильмы с её участием, такие как «Римские каникулы», «Завтрак у Тиффани», «Как украсть миллион» стали киноклассикой, а сам вклад актрисы в кино был оценён множеством кинонаград: двумя «Оскарами», «Золотым глобусом», премиями Британской киноакадемии и звездой на голливудской «Аллее славы». После завершения своей кинокарьеры Одри использовала свою популярность, чтобы помочь благотворительной организации ЮНИСЕФ привлечь внимание общества к проблемам развивающихся стран.']
  },{
    id: 11,
    src: 'img/page11_oskar.jpg',
    alt: 'Статуэтка "Оскар"',
    newSrc: 'img/page11_DiCaprio.jpg',
    newAlt: 'Леонардо ДиКапирио',
    question: ['Этот актёр более пяти раз номинировался на премию «Оскар», но смог получить её относительно недавно. Его имя …'],
    variants: ['Джордж Клуни', 'Леонардо ДиКаприо', 'Джеки Чан', 'Том Хэнкс'],
    rightAns: 1,
    content: ['Леонардо ДиКаприо. После первой номинации на «Оскар» в 1994 году у Леонардо было несколько выдающихся работ: «Титаник», «Поймай меня, если сможешь», «Авиатор», «Кровавый алмаз», «Начало». Но «Оскара» он получил за роль в фильме «Выживший» в 2016 году.','Интересный факт: в том же 2016 году неравнодушные к творчеству ДиКаприо жители Якутии (женщины в первую очередь) собрали почти полтора килограмма серебра и три грамма золота, чтобы отлить копию «Оскара» для актёра. Якутский «Оскар» в итоге был отлит и передан актёру вскоре получения им реальной кинопремии.']
  },{
    id: 12,
    src: 'img/page12_soviet-cinema.jpg',
    alt: 'Советское кино',
    newSrc: 'img/page12_roman.jpg',
    newAlt: 'Кадр из фильма «Служебный роман»',
    question: ['В каком из советских фильмов была произнесена фраза: «Если бы не было статистики, мы бы даже не подозревали о том, как хорошо мы работаем».'],
    variants: ['«Москва словам не верит»', '«Кавказская пленница»', '«Девчата»', '«Служебный роман»'],
    rightAns: 3,
    content: ['В начале фильма «Служебный роман» эти слова за кадром говорит главный герой –Анатолий Ефремович Новосельцев, когда его начальница Людмила Прокофьевна Калугина входит в здание «Статистического учреждения».']
  }  
];